fireFoam/testBatteryFireFOAM/counterFlowMixing2D/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//pyrolysisModel reactingOneDim;
pyrolysisModel none;

noneCoeffs
{
}

reactingOneDimCoeffs
{
    radFluxFieldName    Qr;
    massContinuity      false;
    minimumDelta        1e-8;
}

pyrolysisRegionName panelRegion;

infoOutput      false; //true;
active          false; //true;

// ************************************************************************* //
