fireFoam/testBatteryFireFOAM/counterFlowMixing2D/constant/reactions
species
(
    O2
    H2O
    N2
);

reactions
(
    irreversibleInfiniteReaction
    O2 + 3.76N2 + H2O = O2 + 3.76N2 + H2O 
);
